<template>
  <div>
    <land-header/>
    <v-container>
      <main>
        <br>
        <h1>ТЗ</h1>
        <div>
          <br>
          <hr>
          <br>
        </div>
        <h2>Разрабоать 2 части: Лендин и Приложение</h2>
        <div>
          <br>
          <hr>
          <br>
        </div>
        <h2>Лендин</h2>
        <br>
        В лендинге должны содержаться следующие страницы:
        <ul>
          <br>
          <li>
            <h4>Главная</h4>
            Главная страница содержит в себе основные блоки, такие как:
            <ul>
              <li>+Слайдер с информацией. Здесь будут высвечиватся все новинки и другая информация</li>
              <li>+Небольшой блок "о нас". В пару слов кто такие, остальное в соответсвующей странице</li>
              <li>+Чем хорош наш проект. Сделать краткое описание и скриншоты с проектом, рассказать что в нём хорошего и почему им стоит пользоваться</li>
              <li>+Блок с новостями. В Блоке только 2 актуальные новости, остальные смотреть на странице с новостями</li>
              <li>+Оставьте отзыв и отзывы. Отзыв может оставить только авторизованный человек</li>
            </ul>
          </li>
          <br>
          <li>
            <h4>О нас</h4>
            На странице о нас составить текст о том, как появилась идея, сколько на неё ушло времени, как оно продвигалось и так далее
          </li>
          <br>
          <li>
            <h4>О проекте</h4>
            Это страница с описанием и инструкцией пользования
          </li>
          <br>
          <li>
            <h4>Информация</h4>

          </li>
          <br>
          <li>
            <h4>Блог</h4>
            Сюда будут приходить какие то новости об изменениях, планируемых изменениях, и других событий/изменениях, связанных с проектом
          </li>
          <br>
          <li>
            <h4>Кондифициальность</h4>
            Километровый текст о том, что мы чтим безопасность, молодцы что соблюдаем её + у нас свои приколы и т.д.
          </li>
          <br>
          <li>
            <h4>Контакты</h4>
            Здесь будет контактная информация:
            <ul>
              <li>Телефон</li>
              <li>Email</li>
              <li>ВКонтакте</li>
              <li>WhatsApp</li>
              <li>Телеграмм</li>
            </ul>
          </li>
          <br>
          <li>
            <h4>Кабинет</h4>
            Здесь будет:
            <ul>
              <li>персональные данные</li>
              <li>статус подтверждения аккаунта</li>
              <li>статус активации кода</li>
              <li>код активации</li>
              <li>переход в приложение (если код валидный + статус положительный)</li>
            </ul>
          </li>
          <br>
          <li>
            <h4>Настройки</h4>
            Смена персональных данных
          </li>
          <br>
          <li>
            <h4>Админка</h4>
            В админке есть
            <ul>
              <li>Посты. Добавление/Редактирование/Удаление постов. </li>
              <li>Модерирование пользователей:
                <ul>
                  <li>Изменение ролей</li>
                  <li>Обнулить токен (автоматически обнуляется каждый выбранный период)</li>
                  <li>Удаление пользователя</li>
                  <li>Заблокировтать пользователя</li>
                </ul>
              </li>
              <li>Код активации (токен)
                <ul>
                  <li>Сгенерировать токен</li>
                  <li>Обновить токен</li>
                  <li>Период автообновления (месяц/полгода/год)</li>
                </ul>
              </li>
              <li></li>
            </ul>
          </li>
          <br>
          <li>
            <h4>Вход</h4>
            Логин (email/телефон), пароль
            <br>
            При нажатии на вход, на бекенд отправляются данные (проверка на соответсвие логина и пароля).
            Затем проверяется статус активации, если статус false, вывод соответсвующей ошибки.
            Если статус true, то вход без проблем
          </li>
          <br>
          <li>
            <h4>Регистрация</h4>
            <ul>
              <li>Фамилия *</li>
              <li>Имя *</li>
              <li>Отчество</li>
              <li>Где работаете? (Выбор из: Школа/Техникум/Университет/Другая обучающая организация (если этот пункт, ввести название)) *</li>
              <li>Email *</li>
              <li>Телефон *</li>
              <li>Пароль *</li>
              <li>Повтор пароля *</li>
            </ul>
            <div>
              <br>
              <hr>
              <br>
            </div>
            После нажатия "Регистрация", идёт отправка на бэкенд, сверяются данные, если регистрация успешна, создаётся следующая модель:
            <div>
              <br>
              <hr>
              <br>
            </div>
            <ul>
              <li>Фамилия (обязательное)</li>
              <li>Имя (обязательное)</li>
              <li>Отчество</li>
              <li>Место работы (обязательное)</li>
              <li>Телефон (обязательное, уникальное)</li>
              <li>email (обязательное, уникальное)</li>
              <li>Пароль (обязательное)</li>
              <li>Роль (дефолт: user)</li>
              <li>Статус заблокированного пользователя (дефолт: false)</li>
              <li>Статус первого захода в приложение (дефолт: true)</li>
              <li>Статус подтверждения аккаунта (дефолт: false)</li>
              <li>Ссылка подтверждения аккаунта (генерируется и присваивается на бэке)</li>
              <li>Код активации (дефолт: '')</li>
              <li>Статус активации (дефолт: false)</li>
              <li>Тариф: default</li>
              <li>Дата создания аккаунта</li>
            </ul>
            <div>
              <br>
              <hr>
              <br>
            </div>
            Если пользователь имеет Роль admin, то
            <ul>
              <li>В личном кабинете добавляется возможность зайти на админку</li>
              <li>Редактирование/Удаление постов</li>
              <li>Редактирование/Удаление отзывов</li>
            </ul>
            <div>
              <br>
              <hr>
              <br>
            </div>
            2 Вида аккаунта
            <ul>
              <li>
                <h5>mono</h5>
                Моно рассчитан только на одного человека
              </li>
              <li>
                <h5>multi</h5>
                расчитан на 5+ человек
              </li>
            </ul>
            <div>
              <br>
              <hr>
              <br>
            </div>
            Тарифы 4 категории
            <ul>
              <li>trial - пробный </li>
              <li>default - обычный</li>
              <li>standard - расширенный</li>
              <li>premium - премиум</li>
            </ul>
            <div>
              <br>
              <hr>
              <br>
            </div>
            Тарифы:

            <br>
            <br>

            <h3>На одного пользователя (mono)</h3>

            <v-data-table
              :headers="headersMono"
              :items="pointsMono"
              :items-per-page="5"
              class="elevation-1"
            ></v-data-table>

            <div>
              <br>
              <hr>
              <br>
            </div>

            <br>
            <h3>Мульти аккаунт (multi)</h3>

            <v-data-table
              :headers="headersMulti"
              :items="pointsMulti"
              :items-per-page="5"
              class="elevation-1"
            ></v-data-table>

          </li>
        </ul>

        <div>
          <br>
          <hr>
          <br>
        </div>
        <h2>Приложение</h2>
        <br>
        При первом входе "Статус первого захода в приложение", если значение true, активируется диалоговое окно "Режим обучения".
        <br>
        Если пользователь ответит да, то активируется "Режим обучения", где пользователь тыкает всё с подсказками, проходит обучение и данные обнуляются, "Статус первого захода в приложение" = false
        <br>
        Если пользователь ответит нет, "Режим обучения" не активируется. "Статус первого захода в приложение" = false
        <br>
        (Режим обучения создать после разработки самого приложения)
        <div>
          <br>
          <hr>
          <br>
        </div>
        <h3>Функиональность приложения</h3>

        <ul>
          <br>
          <li>
            <h4>Начала урока</h4>
            В этом режиме. открывается модальное меню, в котором настраивается:
            <div>
              <br>
              <hr>
              <br>
            </div>
            (Если аккаунт Mono) Выбирается что за человек в данный момент планирует пользоваться в данный момент (добавить кнопку "запомнить выбор")
            <br>
            Далее идёт выбор предмета, по которому планируется вести урок
            <br>
            Далее выбирается группа/класс в котором планируется вести урок
            <div>
              <br>
              <hr>
              <br>
            </div>
            (Если аккаунт Multi) Идёт выбор предмета, по которому планируется вести урок
            <br>
            Далее выбирается группа/класс в котором планируется вести урок
            <div>
              <br>
              <hr>
              <br>
            </div>
            Далее выбирается время урока/пары, по которому ставиться таймер окончания.
          </li>
          <br>
          <li>
            <h4>Ведение журнала (оно же работа с базой)</h4>
            Здесь идёт заполнение и работа с данными. (ограничения зависят от тарифа)
            <br>
            Так же можно создать отчёт в <strong><i>docx</i></strong> формате, за определённый период (день/неделю/месяц)
          </li>
          <br>
          <li>
            <h4>Настройка</h4>
            <ul>
              <li>
                <h4>для Mono</h4>
              </li>
              <li>
                <h4>для Multi</h4>
              </li>
            </ul>
          </li>
          <br>
          <li>
            <h4></h4>
          </li>
        </ul>

      </main>
    </v-container>
    <land-footer/>
  </div>
</template>
<script lang="ts">
import {Component,  Vue} from "vue-property-decorator";
@Component
export default class extends Vue {
  headersMono:any = [
    {text: '', value: 'tariff'},
    {text: 'Ограниченный период', value: 'LimitedPeriodOfUse'},
    {text: 'Работа с питанием', value: 'foodMod'},
    {text: 'Статистика и отчётность', value: 'statistic'},
    {text: '.doc .xls .pfd Документы', value: 'docReport'},
    {text: 'Работа с журналом', value: 'WorkingWithJournal'},
    {text: 'Внутрение настройки', value: 'settings'},
    {text: 'Таблиц в журнале', value: 'tablesInJournal'},
    {text: 'Цена за тариф', value: 'price'}
  ]

  pointsMono:any = [
    {
      tariff: 'trial',
      LimitedPeriodOfUse: '+',
      foodMod: '-',
      statistic: 'ограничена',
      docReport: '1 документ в день',
      WorkingWithJournal: '+',
      settings: 'Ограниченные',
      tablesInJournal: 3,
      price: '0'
    },
    {
      tariff: 'standard',
      LimitedPeriodOfUse: '-',
      foodMod: '+',
      statistic: '+',
      docReport: '+',
      WorkingWithJournal: '+',
      settings: 'Стандарт',
      tablesInJournal: 6,
      price: '1500'
    },
    {
      tariff: 'premium',
      LimitedPeriodOfUse: '-',
      foodMod: '+',
      statistic: '+',
      docReport: '+',
      WorkingWithJournal: '+',
      settings: 'Расширенные',
      tablesInJournal: 'без ограничений',
      price: '3000'
    },
  ]

  headersMulti:any = [
    {text: '', value: 'tariff'},
    {text: 'Ограниченный период', value: 'LimitedPeriodOfUse'},
    {text: 'Работа с питанием', value: 'foodMod'},
    {text: 'Статистика и отчётность', value: 'statistic'},
    {text: '.doc .xls .pfd Документы', value: 'docReport'},
    {text: 'Работа с журналом', value: 'WorkingWithJournal'},
    {text: 'Внутрение настройки', value: 'settings'},
    {text: 'Кол-во Пользователей', value: 'numberOfUsers'},
    {text: 'Таблиц в журнале', value: 'tablesInJournal'},
    {text: 'Цена за тариф', value: 'price'}
  ]

  pointsMulti:any = [
    {
      tariff: 'trial',
      LimitedPeriodOfUse: '+',
      foodMod: '-',
      statistic: 'ограничена',
      docReport: '1 документ в день',
      WorkingWithJournal: '+',
      settings: 'Ограниченные',
      numberOfUsers: 2,
      tablesInJournal: 4,
      price: '0'
    },
    {
      tariff: 'default',
      LimitedPeriodOfUse: '-',
      foodMod: '-',
      statistic: '+',
      docReport: '+',
      WorkingWithJournal: '+',
      settings: 'Стандарт',
      numberOfUsers: 4,
      tablesInJournal: 8,
      price: '3500'
    },
    {
      tariff: 'standard',
      LimitedPeriodOfUse: '-',
      foodMod: '+',
      statistic: '+',
      docReport: '+',
      WorkingWithJournal: '+',
      settings: 'Стандарт',
      numberOfUsers: 7,
      tablesInJournal: 11,
      price: '6000'
    },
    {
      tariff: 'premium',
      LimitedPeriodOfUse: '-',
      foodMod: '+',
      statistic: '+',
      docReport: '+',
      WorkingWithJournal: '+',
      settings: 'Расширенные',
      numberOfUsers: 'без ограничений',
      tablesInJournal: 'без ограничений',
      price: '9500'
    },
  ]

}
</script>
